가설검정 : 가설을 세우고 그 가설을 증명하는 과정
(보통은 기각시킬 가설을 영가설로 설정)

1. 가설의 종류
- 귀무가설(영가설 : H0)
- 대립가설(H1)

2. 기각역과 채택역
귀무가설을 기각시킬 구간을 기각역, 
귀무가설을 채택 시킬 구간을 채택역이라 부름

3. 가설 검정 방법
1) 기각역 구하기 : 귀무가설이 참이라는 가정 하의 기각역을 구한 뒤 검정
2) 유의확률 구하기

예제)
A사 K모델 자동차의 연비는 평균 12.5(km/l), 표준편차 0.5(km/l)로 
알려져 있는데, 새로 개발된 엔진을 장착한 40대의 자동차 연비를 
측정한 결과 표본평균이 12.64(km/l)로 나왔다.
새로 개발된 엔진은 기존보다 개선되었다는 가설 검정

H0 : mu = 12.5 
H1 : mu > 12.5

Z = ( xbar - mu ) / (sigma / sqrt(n))
  = (12.64 - 12.5) / (0.5 / sqrt(40))
  = 1.77



예제2) 
랜덤하게 샘플링한 초콜릿 16개 무게의 표본평균이 199.5(g), 
모분산이 25.0라고 알려져 있을 때, 
해당 라인에서 생산된 초콜릿의 무게는 200이다 라는 가설에 대한 검정 수행



