1) dept2 테이블을 이용하여 상위부서명을 다음과 같이 출력하세요.
 "경영지원부의 상위부서는 사장실 입니다."
단, 상위부서가 없는 경우는 본인부서명이 출력되도록 하여라.
(스칼라 서브쿼리 이용)

2) emp 테이블을 이용하여 부서에서 본인보다 입사년도가 빠른 사람의 수를 각 직원의 이름, 부서명과 함께 출력하세요.
단, 선배수가 많은 사람 순으로 정렬하세요
2-1) 조인
2-2) 스칼라 서브쿼리

3) emp 테이블을 이용하여 본인과 상위관리자의 평균연봉보다 많은 연봉을 받는 직원의
이름, 부서명, 연봉, 상위관리자명을 출력하여라.

4) 교수에 대한 전체 자료를 다음과 같은 형식으로 만들어 보자
(단, 모든 교수들에 대해 출력되도록 한다)
교수이름	지도학생수	지도학생_성적평균	A_학점자수	B_학점자수	C_학점자수	D_학점자수
심슨          	2	        79	                1	        0	        0	        1
허은	        2	        83	                0	        1	        1	        0
조인형	        1	        97	                1	        0	        0	        0
