1) EMP테이블과 dept 테이블, p_grade 테이블을 이용하여 각 직원의 이름, 부서명, 
기존직급과 새로운 직급을 나타태어라.
단, 새로운 직급은 근속년수를 기준으로 계산한다;

2) student, exam_01, hakjum 각 학생의 학점을 구하고 각 학점별로 분포된 학생 수를 다음과 같이 구하라.
   A 4
   B 12
   C 3
   D 1
   
3) student 테이블과 exam_01, department 테이블을 이용하여 각 학과별 평균 점수와 최고 점수,
최저 점수를 나타내되 학과이름, 학과번호와 함께 출력되도록 작성하여라.

4) student, professor 테이블에서 같은지역, 같은 성별의 친구가 몇명인지 구하고, 
그 학생의 담당 교수이름도 함께 출력되도록 하여라.
단, 같은지역, 같은 성별에 본인은 포함될 수 없다.

5) student, exam_01, department 테이블에서 각 학생의 시험성적을 기반으로 
같은학과에서 본인보다 시험성적이 우수한 학생수를 나타내도록 하여라.
단, 각 학생의 정보는 학생이름, 학과이름, 시험성적과 함께 출력하여라.
(아우터조인은 고려하지 않는다)